In [2]:
import pandas as pd 

df = pd.read_csv('/Users/jakirice/Desktop/BUY_INSURANCE.csv')
df['OCCUPATION_TYPE'].fillna("NA", inplace = True)
df

,ID,GENDER,OWN CAR,OWN REALTY,NO. OF CHILDREN,ANNUAL INCOME,INCOME_TYPE,EDUCATIONAL DEGREE,CIVIL STATUS,HOUSING_TYPE,DAYS_EMPLOYED,OCCUPATION_TYPE,CNT_FAM_MEMBERS,BUY?
0,5008804,MALE,YES,YES,2,427500,Working,Higher education,Civil marriage,Rented apartment,-4542,NA,2,YES
1,5008805,MALE,YES,YES,2,427500,Working,Higher education,Civil marriage,Rented apartment,-4542,NA,2,NO
2,5008806,MALE,YES,YES,2,112500,Working,Secondary / secondary special,Married,House / apartment,-1134,Security staff,2,NO
3,5008808,FEMALE,NO,YES,0,270000,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-3051,Sales staff,1,NO
4,5008809,FEMALE,NO,YES,0,270000,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-3051,Sales staff,1,NO
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
595,5009469,FEMALE,NO,NO,0,157500,Working,Secondary / secondary special,Married,House / apartment,-9870,NA,2,NO
596,5009470,FEMALE,NO,NO,0,157500,Working,Secondary / secondary special,Married,House / apartment,-9870,NA,2,NO
597,5009471,FEMALE,NO,NO,0,157500,Working,Secondary / secondary special,Married,House / apartment,-9870,NA,2,YES
598,5009472,FEMALE,NO,NO,0,157500,Working,Secondary / secondary special,Married,House / apartment,-9870,NA,2,NO
599,6153617,FEMALE,NO,NO,0,157500,Working,Secondary / secondary special,Married,House / apartment,-9870,NA,2,YES

In [11]:
import pandas as pd 

df = pd.read_csv('/Users/jakirice/Desktop/BUY_INSURANCE.csv')
df['CIVIL STATUS'] = df['CIVIL STATUS'].replace(['Single / not married','Civil marriage'],['Single','Married'])
df

,ID,GENDER,OWN CAR,OWN REALTY,NO. OF CHILDREN,ANNUAL INCOME,INCOME_TYPE,EDUCATIONAL DEGREE,CIVIL STATUS,HOUSING_TYPE,DAYS_EMPLOYED,OCCUPATION_TYPE,CNT_FAM_MEMBERS,BUY?
0,5008804,MALE,YES,YES,2,427500,Working,Higher education,Married,Rented apartment,-4542,NaN,2,YES
1,5008805,MALE,YES,YES,2,427500,Working,Higher education,Married,Rented apartment,-4542,NaN,2,NO
2,5008806,MALE,YES,YES,2,112500,Working,Secondary / secondary special,Married,House / apartment,-1134,Security staff,2,NO
3,5008808,FEMALE,NO,YES,0,270000,Commercial associate,Secondary / secondary special,Single,House / apartment,-3051,Sales staff,1,NO
4,5008809,FEMALE,NO,YES,0,270000,Commercial associate,Secondary / secondary special,Single,House / apartment,-3051,Sales staff,1,NO
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
595,5009469,FEMALE,NO,NO,0,157500,Working,Secondary / secondary special,Married,House / apartment,-9870,NaN,2,NO
596,5009470,FEMALE,NO,NO,0,157500,Working,Secondary / secondary special,Married,House / apartment,-9870,NaN,2,NO
597,5009471,FEMALE,NO,NO,0,157500,Working,Secondary / secondary special,Married,House / apartment,-9870,NaN,2,YES
598,5009472,FEMALE,NO,NO,0,157500,Working,Secondary / secondary special,Married,House / apartment,-9870,NaN,2,NO
599,6153617,FEMALE,NO,NO,0,157500,Working,Secondary / secondary special,Married,House / apartment,-9870,NaN,2,YES

In [25]:
import pandas as pd 

df = pd.read_csv('/Users/jakirice/Desktop/BUY_INSURANCE.csv')
df['DAYS_EMPLOYED'] = df['DAYS_EMPLOYED'].apply(lambda x: x * -1 if x < 0 else x)
df['DAYS_EMPLOYED'] = df['DAYS_EMPLOYED'].apply(lambda x: x / 365)
df.rename(columns={'DAYS_EMPLOYED': 'YEARS_EMPLOYED'},inplace = True)
df.sort_values(by=['YEARS_EMPLOYED'], ascending=False)

,ID,GENDER,OWN CAR,OWN REALTY,NO. OF CHILDREN,ANNUAL INCOME,INCOME_TYPE,EDUCATIONAL DEGREE,CIVIL STATUS,HOUSING_TYPE,YEARS_EMPLOYED,OCCUPATION_TYPE,CNT_FAM_MEMBERS,BUY?
300,5009134,MALE,NO,YES,0,382500,Pensioner,Secondary / secondary special,Widow,House / apartment,1000.665753,NaN,1,YES
447,5009302,FEMALE,NO,NO,0,112500,Pensioner,Secondary / secondary special,Widow,House / apartment,1000.665753,NaN,1,YES
306,5009140,MALE,NO,YES,0,382500,Pensioner,Secondary / secondary special,Widow,House / apartment,1000.665753,NaN,1,YES
309,5009143,MALE,YES,NO,0,225000,Pensioner,Secondary / secondary special,Civil marriage,House / apartment,1000.665753,NaN,2,NO
310,5009144,MALE,YES,NO,0,225000,Pensioner,Secondary / secondary special,Civil marriage,House / apartment,1000.665753,NaN,2,NO
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
535,5009402,MALE,NO,NO,0,202500,Commercial associate,Secondary / secondary special,Married,House / apartment,0.690411,Security staff,2,NO
487,5009354,MALE,NO,NO,0,180000,Commercial associate,Lower secondary,Married,House / apartment,0.356164,Drivers,2,YES
488,6153582,MALE,NO,NO,0,180000,Commercial associate,Lower secondary,Married,House / apartment,0.356164,Drivers,2,NO
489,6153584,MALE,NO,NO,0,180000,Commercial associate,Lower secondary,Married,House / apartment,0.356164,Drivers,2,YES
486,5009349,MALE,NO,NO,0,180000,Commercial associate,Lower secondary,Married,House / apartment,0.356164,Drivers,2,NO

In [23]:
print('Range is: ',df.YEARS_EMPLOYED.max()-df.YEARS_EMPLOYED.min())
print('Max value is: ',df.YEARS_EMPLOYED.max())
print('Min value is: ',df.YEARS_EMPLOYED.min())
print("Average value is: ",df.YEARS_EMPLOYED.mean())

Range is:  1000.3095890410958
Max value is:  1000.6657534246575
Min value is:  0.3561643835616438
Average value is:  118.8998630136987

In [34]:
df['OWN CAR'].value_counts()

NO     390
YES    210
Name: OWN CAR, dtype: int64

In [47]:
car = df['OWN CAR']
realty = df['OWN REALTY']
realtyowner = realty[realty == 'YES'].count()
carowner = car[car == 'YES'].count()
print('Clients that owns a car: {}'.format(carowner))
print('Clients that owns realty: {}'.format(realtyowner))

Clients that owns a car: 210
Clients that owns realty: 275

In [50]:
df.sample(100,replace=False)

,ID,GENDER,OWN CAR,OWN REALTY,NO. OF CHILDREN,ANNUAL INCOME,INCOME_TYPE,EDUCATIONAL DEGREE,CIVIL STATUS,HOUSING_TYPE,YEARS_EMPLOYED,OCCUPATION_TYPE,CNT_FAM_MEMBERS,BUY?
200,5009018,FEMALE,NO,YES,2,216000,State servant,Higher education,Married,House / apartment,8.526027,NaN,4,YES
229,5009047,FEMALE,NO,YES,0,148500,Working,Higher education,Married,House / apartment,2.435616,Core staff,2,YES
547,5009418,FEMALE,NO,NO,0,90000,Working,Secondary / secondary special,Single / not married,House / apartment,1.271233,Core staff,1,NO
527,6153591,MALE,NO,NO,0,279000,State servant,Higher education,Single / not married,House / apartment,8.695890,Core staff,1,NO
452,5009307,FEMALE,YES,NO,0,135000,Pensioner,Secondary / secondary special,Married,House / apartment,1000.665753,NaN,2,YES
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
345,5009186,FEMALE,NO,NO,0,270000,Working,Higher education,Married,House / apartment,15.868493,Managers,2,YES
283,5009110,FEMALE,NO,YES,0,112500,Commercial associate,Higher education,Married,House / apartment,0.854795,High skill tech staff,2,NO
368,5009213,FEMALE,NO,NO,0,270000,Working,Higher education,Married,House / apartment,2.356164,Accountants,2,NO
85,5008895,FEMALE,NO,YES,0,297000,Commercial associate,Secondary / secondary special,Single / not married,Rented apartment,8.860274,Laborers,1,YES
365,5009210,FEMALE,NO,NO,0,292500,State servant,Secondary / secondary special,Married,House / apartment,23.791781,Accountants,2,YES